FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
        if( prvGetPhyLinkStatus( pxInterface ) == pdFALSE )
        {
            FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: Link Down\n" ) );
            break;
        }

        if( ( xMacInitStatus != eMacInitComplete ) || ( HAL_ETH_GetState( pxEthHandle ) != HAL_ETH_STATE_STARTED ) )
        {
            FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: Interface Not Started\n" ) );
            break;
        }

        if( xSemaphoreTake( xTxDescSem, pdMS_TO_TICKS( niEMAC_DESCRIPTOR_WAIT_TIME_MS ) ) == pdFALSE )
        {
            FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: No Descriptors Available\n" ) );
            break;
        }

        if( xSemaphoreTake( xTxMutex, pdMS_TO_TICKS( niEMAC_TX_MAX_BLOCK_TIME_MS ) ) == pdFALSE )
        {
            FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: Process Busy\n" ) );
            ( void ) xSemaphoreGive( xTxDescSem );
            /* TODO: Can we queue it? */
            break;
        }

        /* static ETH_BufferTypeDef xTxBuffers[ niEMAC_BUFS_PER_DESC * ETH_TX_DESC_CNT ] = { 0 }; */

        static ETH_TxPacketConfig xTxConfig = {
            .Attributes = ETH_TX_PACKETS_FEATURES_CRCPAD,
            .Length = 0U,
            .TxBuffer = NULL,
            .SrcAddrCtrl = ETH_SRC_ADDR_CONTROL_DISABLE,
            .CRCPadCtrl = ETH_CRC_PAD_INSERT,
            .ChecksumCtrl = ETH_CHECKSUM_IPHDR_PAYLOAD_INSERT_PHDR_CALC,
            .MaxSegmentSize = ipconfigTCP_MSS,
            .PayloadLen = 0U,
            .TCPHeaderLen = 0U,
            .VlanTag = 0U,
            .VlanCtrl = ETH_VLAN_DISABLE,
            .InnerVlanTag = 0U,
            .InnerVlanCtrl = ETH_INNER_VLAN_DISABLE,
            .pData = NULL,
        };

        #if ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM )
            xTxConfig.Attributes |= ETH_TX_PACKETS_FEATURES_CSUM;
        #endif

        #if 0

            const EthernetHeader_t * const pxEthHeader = ( const EthernetHeader_t * const ) pxDescriptor->pucEthernetBuffer;

            if( pxEthHeader->usFrameType == ipIPv4_FRAME_TYPE )
            {
                #if ipconfigIS_ENABLED( ipconfigUSE_IPv4 )
                    const IPPacket_t * const pxIPPacket = ( const IPPacket_t * const ) pxDescriptor->pucEthernetBuffer;

                    if( pxIPPacket->xIPHeader.ucProtocol == ipPROTOCOL_ICMP )
                    {
                        ICMPPacket_t * const pxICMPPacket = ( ICMPPacket_t * const ) pxDescriptor->pucEthernetBuffer;
                        #if ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM )
                            pxICMPPacket->xICMPHeader.usChecksum = 0U;
                        #endif
                    }
                    else if( pxIPPacket->xIPHeader.ucProtocol == ipPROTOCOL_TCP )
                    {
                        TCPPacket_t * const pxTCPPacket = ( TCPPacket_t * const ) pxDescriptor->pucEthernetBuffer;
                        #if ipconfigIS_ENABLED( ipconfigUSE_TCP ) /* && ipconfigIS_DISABLED( ipconfigUSE_TCP_WIN ) */
                            /* pxTCPSocketLookup */
                            xTxConfig.PayloadLen = pxTCPPacket->xIPHeader.usLength;
                            xTxConfig.TCPHeaderLen = ( ( pxTCPPacket->xIPHeader.ucVersionHeaderLength & ( uint8_t ) 0x0FU ) * 4U );
                            xTxConfig.Attributes |= ETH_TX_PACKETS_FEATURES_TSO;
                        #endif
                    }
                #endif /* if ipconfigIS_ENABLED( ipconfigUSE_IPv4 ) */
            }
            else if( pxEthHeader->usFrameType == ipIPv6_FRAME_TYPE )
            {
                /* #if ipconfigIS_ENABLED( ipconfigUSE_IPv6 ) */
                    const IPPacket_IPv6_t * pxIPPacket_IPv6 = ( IPPacket_IPv6_t * ) pxDescriptor->pucEthernetBuffer;

                    if( pxIPPacket_IPv6->xIPHeader.ucNextHeader == ipPROTOCOL_ICMP_IPv6 )
                    {
                        ICMPPacket_IPv6_t * const pxICMPPacket_IPv6 = ( ICMPPacket_IPv6_t * const ) pxDescriptor->pucEthernetBuffer;
                        #if ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM )
                            pxICMPPacket_IPv6->xICMPHeaderIPv6.usChecksum = 0U;
                        #endif
                    }
                    else if( pxIPPacket_IPv6->xIPHeader.ucNextHeader == ipPROTOCOL_TCP )
                    {
                        TCPPacket_IPv6_t * const pxTCPPacket_IPv6 = ( TCPPacket_IPv6_t * const ) pxDescriptor->pucEthernetBuffer;
                        #if ipconfigIS_ENABLED( ipconfigUSE_TCP ) /* && ipconfigIS_DISABLED( ipconfigUSE_TCP_WIN ) */
                            xTxConfig.PayloadLen = pxTCPPacket_IPv6->xIPHeader.usPayloadLength;
                            xTxConfig.TCPHeaderLen = sizeof( pxTCPPacket_IPv6->xTCPHeader );
                            xTxConfig.Attributes |= ETH_TX_PACKETS_FEATURES_TSO;
                        #endif
                    }
                /* #endif */ /* if ipconfigIS_ENABLED( ipconfigUSE_IPv6 ) */
            }
            else if( pxEthHeader->usFrameType == ipARP_FRAME_TYPE )
            {

            }

        #endif

        ETH_BufferTypeDef xTxBuffer = {
            .buffer = pxDescriptor->pucEthernetBuffer,
            .len = pxDescriptor->xDataLength,
            .next = NULL
        };

        xTxConfig.pData = pxDescriptor;
        xTxConfig.TxBuffer = &xTxBuffer;
        xTxConfig.Length = xTxBuffer.len;

        if( HAL_ETH_Transmit_IT( pxEthHandle, &xTxConfig ) == HAL_OK )
        {
            /* Released later in deferred task by calling HAL_ETH_ReleaseTxPacket */
            xReleaseAfterSend = pdFALSE;
            xResult = pdPASS;
        }
        else
        {
            ( void ) xSemaphoreGive( xTxDescSem );
            configASSERT( HAL_ETH_GetState( pxEthHandle ) == HAL_ETH_STATE_STARTED );
            niEMAC_DEBUG( ( HAL_ETH_GetError( pxEthHandle ) & HAL_ETH_ERROR_BUSY ) != 0, "xNetworkInterfaceOutput: Tx Busy\n" );
            /* Add to queue? */
        }
        ( void ) xSemaphoreGive( xTxMutex );

    } while( pdFALSE );

    if( xReleaseAfterSend == pdTRUE )
    {
        prvReleaseNetworkBufferDescriptor( pxDescriptor );
    }

    return xResult;
}

