FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
/*---------------------------------------------------------------------------*/

static void prvAddAllowedMACAddress( const uint8_t * pucMacAddress )
{
    BaseType_t xFoundMatch = pdFALSE;
    for( UBaseType_t uxIndex = 0; uxIndex < niEMAC_MAC_SRC_MATCH_COUNT; ++uxIndex )
    {
        if( ucSrcMatchCounters[ uxIndex ] > 0U )
        {
            /* Temporary inefficient method to avoid writing a HAL_ETH_GetSourceMACAddrMatch for Hx & Fx */
            if( memcmp( pucMacAddress, xMatchedMacAddresses[ uxIndex ].ucBytes, ipMAC_ADDRESS_LENGTH_BYTES ) == 0 )
            {
                /* Already assigned this mac address */
                ++( ucSrcMatchCounters[ uxIndex ] );
                xFoundMatch = pdTRUE;
                break;
            }
        }
        else
        {
            if( uxMACEntryIndex > niEMAC_MAC_SRC_MATCH_COUNT )
            {
                uxMACEntryIndex = niEMAC_MAC_SRC_MATCH_COUNT;
            }
        }
    }

    if( xFoundMatch == pdFALSE )
    {
        ETH_HandleTypeDef * pxEthHandle = &xEthHandle;

        const uint32_t ulHash = prvCalcCrc32( pucMacAddress );
        const uint8_t ucHashIndex = ( ulHash >> 26 ) & 0x3FU;

        if( uxMACEntryIndex < niEMAC_MAC_SRC_MATCH_COUNT )
        {
            if( ucAddrHashCounters[ ucHashIndex ] == 0U )
            {
                ( void ) HAL_ETH_SetSourceMACAddrMatch( pxEthHandle, xMacAddressEntries[ uxMACEntryIndex ], ( uint8_t * ) pucMacAddress );
                ( void ) memcpy( xMatchedMacAddresses[ uxMACEntryIndex ].ucBytes, pucMacAddress, ipMAC_ADDRESS_LENGTH_BYTES );
                ucSrcMatchCounters[ uxMACEntryIndex ] = 1U;
                xFoundMatch = pdTRUE;
            }
        }

        if( xFoundMatch == pdFALSE )
        {
            if( ucAddrHashCounters[ ucHashIndex ] == 0 )
            {
                if( ucHashIndex & 0x20U )
                {
                    ulHashTable[ 1 ] |= ( 1U << ( ucHashIndex & 0x1FU ) );
                }
                else
                {
                    ulHashTable[ 0 ] |= ( 1U << ucHashIndex );
                }

                ( void ) HAL_ETH_SetHashTable( pxEthHandle, ulHashTable );
            }

            if( ucAddrHashCounters[ ucHashIndex ] < UINT8_MAX )
            {
                ++( ucAddrHashCounters[ ucHashIndex ] );
            }
        }
    }
}

/*---------------------------------------------------------------------------*/

static void prvRemoveAllowedMACAddress( const uint8_t * pucMacAddress )
{
    ETH_HandleTypeDef * pxEthHandle = &xEthHandle;
    BaseType_t xFoundMatch = pdFALSE;
    for( UBaseType_t uxIndex = 0; uxIndex < niEMAC_MAC_SRC_MATCH_COUNT; ++uxIndex )
    {
        if( ucSrcMatchCounters[ uxIndex ] > 0U )
        {
            /* Temporary inefficient method to avoid writing a HAL_ETH_GetSourceMACAddrMatch for Hx & Fx */
            if( memcmp( pucMacAddress, xMatchedMacAddresses[ uxIndex ].ucBytes, ipMAC_ADDRESS_LENGTH_BYTES ) == 0 )
            {
                if( ucSrcMatchCounters[ uxIndex ] < UINT8_MAX )
                {
                    --( ucSrcMatchCounters[ uxIndex ] );

                    if( ucSrcMatchCounters[ uxIndex ] == 0 )
                    {
                        /* TODO: Just disable it, don't need to clear? */
                        ( void ) memset( &( xMatchedMacAddresses[ uxIndex ].ucBytes ), 0, ipMAC_ADDRESS_LENGTH_BYTES );
                        ( void ) HAL_ETH_SetSourceMACAddrMatch( pxEthHandle, xMacAddressEntries[ uxIndex ], xMatchedMacAddresses[ uxIndex ].ucBytes );
                    }
                }
                xFoundMatch = pdTRUE;
                break;
            }
        }
    }

    if( xFoundMatch == pdFALSE )
    {
        const uint32_t ulHash = prvCalcCrc32( pucMacAddress );
        const uint8_t ucHashIndex = ( ulHash >> 26 ) & 0x3FU;

        if( ucAddrHashCounters[ ucHashIndex ] > 0U )
        {
            if( ucAddrHashCounters[ ucHashIndex ] < UINT8_MAX )
            {
                --( ucAddrHashCounters[ ucHashIndex ] );

                if( ucAddrHashCounters[ ucHashIndex ] == 0 )
                {
                    if( ucHashIndex & 0x20U )
                    {
                        ulHashTable[ 1 ] &= ~( 1U << ( ucHashIndex & 0x1FU ) );
                    }
                    else
                    {
                        ulHashTable[ 0 ] &= ~( 1U << ucHashIndex );
                    }

                    ( void ) HAL_ETH_SetHashTable( pxEthHandle, ulHashTable );
                }
            }
        }
    }
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                              EMAC Task                                    */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

static BaseType_t prvNetworkInterfaceInput( ETH_HandleTypeDef * pxEthHandle, NetworkInterface_t * pxInterface )
{
    BaseType_t xResult = pdFALSE;
    UBaseType_t uxCount = 0;
    #if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES )
        NetworkBufferDescriptor_t * pxStartDescriptor = NULL;
        NetworkBufferDescriptor_t * pxEndDescriptor = NULL;
    #endif
    NetworkBufferDescriptor_t * pxCurDescriptor = NULL;
    if( ( xMacInitStatus == eMacInitComplete ) && ( HAL_ETH_GetState( pxEthHandle ) == HAL_ETH_STATE_STARTED ) )
    {
        while( HAL_ETH_ReadData( pxEthHandle, ( void ** ) &pxCurDescriptor ) == HAL_OK )
        {
            ++uxCount;
            if( pxCurDescriptor == NULL )
            {
                /* Buffer was dropped, ignore packet */
                continue;
            }
            configASSERT( pxEthHandle->RxDescList.RxDataLength <= niEMAC_DATA_BUFFER_SIZE );

            pxCurDescriptor->pxInterface = pxInterface;
            pxCurDescriptor->pxEndPoint = FreeRTOS_MatchingEndpoint( pxCurDescriptor->pxInterface, pxCurDescriptor->pucEthernetBuffer );
            #if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES )
                if( pxStartDescriptor == NULL )
                {
                    pxStartDescriptor = pxCurDescriptor;
                }
                else if( pxEndDescriptor != NULL )
                {
                    pxEndDescriptor->pxNextBuffer = pxCurDescriptor;
                }
                pxEndDescriptor = pxCurDescriptor;
            #else
                prvSendRxEvent( pxCurDescriptor );
            #endif
        }
    }

